export const state = ()=>({
    products : [
        {
            name:"نایک",
            id:1,
            price:3000,
            description:`
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
                استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است ولورم ایپسوم متن ساختگی با تولید
                سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
            
             `,
            image:require('../assets/png/1.png'),
            quantity:0,
            discount:20,
            Sizes:[40,41,42,],
            colors:["سفید","آبی"]
    
        },
        {
            name:"سیوان",
            id:2,
            price:6000,
            description:`
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
                استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است ولورم ایپسوم متن ساختگی با تولید
                سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
          `,
            image:require('../assets/png/2.png'),
            quantity:0,
            discount:30,
            Sizes:[40,41,42,44,],
            colors:["سفید","آبی"]
    
        },
        {
            name:"ادیداس",
            id:3,
            price:9000,
            description:`
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
                استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است ولورم ایپسوم متن ساختگی با تولید
                سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
       
             `,
            image:require('../assets/png/3.png'),
            quantity:0,
            discount:50,
            Sizes:[40,41,42,],
            colors:["سفید","آبی"]
    
        },
        {
            name:"چرم تبریز",
            id:4,
            price:12000,
            description:`
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
                استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است ولورم ایپسوم متن ساختگی با تولید
                سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
      
             `,
            image:require('../assets/png/4.png'),
            quantity:0,
            discount:18,
            Sizes:[40,,42,43,,45],
            colors:["سفید","آبی"]
    
        },
        {
            name:"ملی",
            id:5,
            price:15000,
            description:`
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
                استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است ولورم ایپسوم متن ساختگی با تولید
                سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
         
             `,
            image:require('../assets/png/5.png'),
            quantity:0,
            discount:12,
            Sizes:[40,41,42,44,],
            colors:["سفید","آبی"]
    
        },
    ],
    
})
export const getters ={
    findproduct:(state) => (id)=>{
        return state.products.find(item => item.id === id)
    }
}
export const mutations ={}
export const actions ={}